#用于套路字符串，填充
#%c字符，%d整数，%s字符串,%f浮点数  %e指数
print("pass is %c  --------" %('X'))
print("何丰成有%d个女神" %(10))  #格式化严格对应，可能会出现异常
print("何丰成女神的名字=%s---" %("凤姐"))
print("何丰成为女神花了%f元"%(123456.78321321))
print("何丰成为女神花了%.2f元"%(123456.78321321))
print("何丰成为女神花了%e元"%(123456.78321321))
print("何丰成为女神花了%.2e元"%(123456.78321321))

#10代表宽度  ，默认是右对齐，-代表左对齐  .2f代表小数点后面两位
#左边默认填充空格，填空为0，加上0
print("%-10.2f %f"%(1.23,1.9))
print("%-10.2f %f"%(1.2345,2.19))
print("%010.2f %f"%(1.234567,3.129))
print("%010.2f %f"%(1.2345678,4.1239))
print("hello  %%    %f" %(10.5)) #%%代表输出一个%，为了区别
